# Taps
# https://github.com/dteoh/homebrew-sqa - SQL query analyzer
tap "dteoh/sqa"
# https://github.com/hashicorp/homebrew-tap - Terraform tools
tap "hashicorp/homebrew-tap"
# https://github.com/jackielii/homebrew-tap
tap "jackielii/tap"
# https://github.com/romkatv/powerlevel10k - Zsh theme
tap "romkatv/powerlevel10k"
# https://github.com/warrensbox/homebrew-tap - tfswitch
tap "warrensbox/homebrew-tap"

brew "ansiweather"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "claude-code-router"
brew "colordiff"
brew "coreutils"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "git"
brew "git-remote-codecommit"
brew "go"
brew "googleworkspace-cli"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "kind"
brew "kubectl"
brew "kubie"
brew "lynx"
brew "mas"
brew "midnight-commander"
brew "neovim"
brew "nmap"
brew "node@22"
brew "ollama"
brew "opencode"
brew "packer"
brew "pgcli"
brew "pipenv"
brew "pnpm"
brew "pyenv"
brew "python@3.13"
brew "qt"
brew "rclone"
brew "ripgrep"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "shellcheck"
brew "telnet"
brew "terraform-ls"
brew "tflint"
brew "warrensbox/tap/tfswitch"
brew "thefuck"
brew "tldr"
brew "tmate"
brew "tmux"
brew "unison"
brew "watch"
brew "wget"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "antigravity"
cask "arc"
cask "audio-hijack"
cask "claude"
cask "claude-code"
cask "cyberghost-vpn"
cask "daisydisk"
cask "descript"
cask "discord"
cask "duckduckgo"
cask "figma"
cask "firefox"
cask "gcloud-cli"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "granola"
cask "hiddenbar"
cask "iterm2"
cask "keyboard-maestro"
cask "lark"
cask "lm-studio"
cask "macwhisper"
cask "nordvpn"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "opal"
cask "opencore-patcher"
cask "opera-gx"
cask "pocket-casts"
cask "raycast"
cask "slack"
cask "spotify"
cask "superhuman"
cask "tailscale"
cask "telegram"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zoom"
